# ShapeSet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..ShapeSet Property
ViewCropRegionShapeManager Class See Also
---
Whether or not the view crop has a non-rectangular shape set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ShapeSet { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ShapeSet As Boolean
	Get
```

Visual C++
---
```text
public:
property bool ShapeSet {
	bool get ();
}
```

# Remarks
This property reflects the actual shape of the crop region. Thus, if this property is true the view Split property is false.
# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace